#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.azurerm_subscription.current: Reading...[0m[0m
[0m[1mdata.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/c3c359ea-23a0-4696-9b8a-2d92aafdd97c][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # azurerm_bastion_host.bastion[0m will be created
[0m  [32m+[0m[0m resource "azurerm_bastion_host" "bastion" {
      [32m+[0m[0m copy_paste_enabled        = true
      [32m+[0m[0m dns_name                  = (known after apply)
      [32m+[0m[0m file_copy_enabled         = false
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ip_connect_enabled        = false
      [32m+[0m[0m kerberos_enabled          = false
      [32m+[0m[0m location                  = "uksouth"
      [32m+[0m[0m name                      = "example-bastion"
      [32m+[0m[0m resource_group_name       = "lw-weaponofchoice-rg"
      [32m+[0m[0m scale_units               = 2
      [32m+[0m[0m session_recording_enabled = false
      [32m+[0m[0m shareable_link_enabled    = false
      [32m+[0m[0m sku                       = "Standard"
      [32m+[0m[0m tunneling_enabled         = true

      [32m+[0m[0m ip_configuration {
          [32m+[0m[0m name                 = "configuration"
          [32m+[0m[0m public_ip_address_id = (known after apply)
          [32m+[0m[0m subnet_id            = (known after apply)
        }
    }

[1m  # azurerm_container_registry.acr[0m will be created
[0m  [32m+[0m[0m resource "azurerm_container_registry" "acr" {
      [32m+[0m[0m admin_enabled                 = true
      [32m+[0m[0m admin_password                = (sensitive value)
      [32m+[0m[0m admin_username                = (known after apply)
      [32m+[0m[0m encryption                    = (known after apply)
      [32m+[0m[0m export_policy_enabled         = true
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "uksouth"
      [32m+[0m[0m login_server                  = (known after apply)
      [32m+[0m[0m name                          = "lwweaponofchoicecr"
      [32m+[0m[0m network_rule_bypass_option    = "AzureServices"
      [32m+[0m[0m network_rule_set              = (known after apply)
      [32m+[0m[0m public_network_access_enabled = true
      [32m+[0m[0m resource_group_name           = "lw-weaponofchoice-rg"
      [32m+[0m[0m sku                           = "Basic"
      [32m+[0m[0m trust_policy_enabled          = false
      [32m+[0m[0m zone_redundancy_enabled       = false
    }

[1m  # azurerm_linux_virtual_machine_scale_set.vmss[0m will be created
[0m  [32m+[0m[0m resource "azurerm_linux_virtual_machine_scale_set" "vmss" {
      [32m+[0m[0m admin_username                                    = "louisadmin"
      [32m+[0m[0m computer_name_prefix                              = (known after apply)
      [32m+[0m[0m disable_password_authentication                   = true
      [32m+[0m[0m do_not_run_extensions_on_overprovisioned_machines = false
      [32m+[0m[0m extension_operations_enabled                      = true
      [32m+[0m[0m extensions_time_budget                            = "PT1H30M"
      [32m+[0m[0m id                                                = (known after apply)
      [32m+[0m[0m instances                                         = 1
      [32m+[0m[0m location                                          = "uksouth"
      [32m+[0m[0m max_bid_price                                     = -1
      [32m+[0m[0m name                                              = "example-vmss"
      [32m+[0m[0m overprovision                                     = true
      [32m+[0m[0m platform_fault_domain_count                       = (known after apply)
      [32m+[0m[0m priority                                          = "Regular"
      [32m+[0m[0m provision_vm_agent                                = true
      [32m+[0m[0m resource_group_name                               = "lw-weaponofchoice-rg"
      [32m+[0m[0m single_placement_group                            = true
      [32m+[0m[0m sku                                               = "Standard_B2s"
      [32m+[0m[0m unique_id                                         = (known after apply)
      [32m+[0m[0m upgrade_mode                                      = "Manual"
      [32m+[0m[0m zone_balance                                      = false

      [32m+[0m[0m admin_ssh_key {
          [32m+[0m[0m public_key = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAqBqq73iIj6OTtZ5ESi3Igz0cy+MkGdvzvw5wNyDZK6 louisware@SoliriusC93Y0Q3GNW"
          [32m+[0m[0m username   = "louisadmin"
        }
      [32m+[0m[0m admin_ssh_key {
          [32m+[0m[0m public_key = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICzpGAbyHYWeexyISdlHUUEoIMtguIY/ENQcEo2edqZJ louisware@SoliriusC93Y0Q3GNW"
          [32m+[0m[0m username   = "louisadmin"
        }

      [32m+[0m[0m automatic_instance_repair (known after apply)

      [32m+[0m[0m extension (known after apply)

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }

      [32m+[0m[0m network_interface {
          [32m+[0m[0m enable_accelerated_networking = false
          [32m+[0m[0m enable_ip_forwarding          = false
          [32m+[0m[0m name                          = "vmss-nic"
          [32m+[0m[0m network_security_group_id     = (known after apply)
          [32m+[0m[0m primary                       = true

          [32m+[0m[0m ip_configuration {
              [32m+[0m[0m name      = "internal"
              [32m+[0m[0m primary   = true
              [32m+[0m[0m subnet_id = (known after apply)
              [32m+[0m[0m version   = "IPv4"
            }
        }

      [32m+[0m[0m os_disk {
          [32m+[0m[0m caching                   = "ReadWrite"
          [32m+[0m[0m disk_size_gb              = (known after apply)
          [32m+[0m[0m storage_account_type      = "Standard_LRS"
          [32m+[0m[0m write_accelerator_enabled = false
        }

      [32m+[0m[0m source_image_reference {
          [32m+[0m[0m offer     = "0001-com-ubuntu-server-jammy"
          [32m+[0m[0m publisher = "Canonical"
          [32m+[0m[0m sku       = "22_04-lts"
          [32m+[0m[0m version   = "latest"
        }

      [32m+[0m[0m spot_restore (known after apply)

      [32m+[0m[0m termination_notification (known after apply)
    }

[1m  # azurerm_network_security_group.vm_nsg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_network_security_group" "vm_nsg" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "uksouth"
      [32m+[0m[0m name                = "ansible-app-server-nsg"
      [32m+[0m[0m resource_group_name = "lw-weaponofchoice-rg"
      [32m+[0m[0m security_rule       = [
          [32m+[0m[0m {
              [32m+[0m[0m access                                     = "Allow"
              [32m+[0m[0m destination_address_prefix                 = "*"
              [32m+[0m[0m destination_address_prefixes               = []
              [32m+[0m[0m destination_application_security_group_ids = []
              [32m+[0m[0m destination_port_range                     = "22"
              [32m+[0m[0m destination_port_ranges                    = []
              [32m+[0m[0m direction                                  = "Inbound"
              [32m+[0m[0m name                                       = "ssh-allow-from-bastion"
              [32m+[0m[0m priority                                   = 1001
              [32m+[0m[0m protocol                                   = "Tcp"
              [32m+[0m[0m source_address_prefix                      = "10.0.2.0/24"
              [32m+[0m[0m source_address_prefixes                    = []
              [32m+[0m[0m source_application_security_group_ids      = []
              [32m+[0m[0m source_port_range                          = "*"
              [32m+[0m[0m source_port_ranges                         = []
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
          [32m+[0m[0m {
              [32m+[0m[0m access                                     = "Allow"
              [32m+[0m[0m destination_address_prefix                 = "*"
              [32m+[0m[0m destination_address_prefixes               = []
              [32m+[0m[0m destination_application_security_group_ids = []
              [32m+[0m[0m destination_port_range                     = "3001"
              [32m+[0m[0m destination_port_ranges                    = []
              [32m+[0m[0m direction                                  = "Inbound"
              [32m+[0m[0m name                                       = "grafana-allow"
              [32m+[0m[0m priority                                   = 1005
              [32m+[0m[0m protocol                                   = "Tcp"
              [32m+[0m[0m source_address_prefix                      = "*"
              [32m+[0m[0m source_address_prefixes                    = []
              [32m+[0m[0m source_application_security_group_ids      = []
              [32m+[0m[0m source_port_range                          = "*"
              [32m+[0m[0m source_port_ranges                         = []
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
          [32m+[0m[0m {
              [32m+[0m[0m access                                     = "Allow"
              [32m+[0m[0m destination_address_prefix                 = "*"
              [32m+[0m[0m destination_address_prefixes               = []
              [32m+[0m[0m destination_application_security_group_ids = []
              [32m+[0m[0m destination_port_range                     = "8080"
              [32m+[0m[0m destination_port_ranges                    = []
              [32m+[0m[0m direction                                  = "Inbound"
              [32m+[0m[0m name                                       = "8080-allow"
              [32m+[0m[0m priority                                   = 1003
              [32m+[0m[0m protocol                                   = "Tcp"
              [32m+[0m[0m source_address_prefix                      = "*"
              [32m+[0m[0m source_address_prefixes                    = []
              [32m+[0m[0m source_application_security_group_ids      = []
              [32m+[0m[0m source_port_range                          = "*"
              [32m+[0m[0m source_port_ranges                         = []
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
          [32m+[0m[0m {
              [32m+[0m[0m access                                     = "Allow"
              [32m+[0m[0m destination_address_prefix                 = "*"
              [32m+[0m[0m destination_address_prefixes               = []
              [32m+[0m[0m destination_application_security_group_ids = []
              [32m+[0m[0m destination_port_range                     = "9090"
              [32m+[0m[0m destination_port_ranges                    = []
              [32m+[0m[0m direction                                  = "Inbound"
              [32m+[0m[0m name                                       = "prometheus-allow"
              [32m+[0m[0m priority                                   = 1004
              [32m+[0m[0m protocol                                   = "Tcp"
              [32m+[0m[0m source_address_prefix                      = "*"
              [32m+[0m[0m source_address_prefixes                    = []
              [32m+[0m[0m source_application_security_group_ids      = []
              [32m+[0m[0m source_port_range                          = "*"
              [32m+[0m[0m source_port_ranges                         = []
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ]
    }

[1m  # azurerm_public_ip.bastion_public_ip[0m will be created
[0m  [32m+[0m[0m resource "azurerm_public_ip" "bastion_public_ip" {
      [32m+[0m[0m allocation_method       = "Static"
      [32m+[0m[0m ddos_protection_mode    = "VirtualNetworkInherited"
      [32m+[0m[0m fqdn                    = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m idle_timeout_in_minutes = 4
      [32m+[0m[0m ip_address              = (known after apply)
      [32m+[0m[0m ip_version              = "IPv4"
      [32m+[0m[0m location                = "uksouth"
      [32m+[0m[0m name                    = "bastion-pip"
      [32m+[0m[0m resource_group_name     = "lw-weaponofchoice-rg"
      [32m+[0m[0m sku                     = "Standard"
      [32m+[0m[0m sku_tier                = "Regional"
    }

[1m  # azurerm_resource_group.rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "uksouth"
      [32m+[0m[0m name     = "lw-weaponofchoice-rg"
    }

[1m  # azurerm_subnet.bastion_subnet[0m will be created
[0m  [32m+[0m[0m resource "azurerm_subnet" "bastion_subnet" {
      [32m+[0m[0m address_prefixes                              = [
          [32m+[0m[0m "10.0.2.0/24",
        ]
      [32m+[0m[0m default_outbound_access_enabled               = true
      [32m+[0m[0m id                                            = (known after apply)
      [32m+[0m[0m name                                          = "AzureBastionSubnet"
      [32m+[0m[0m private_endpoint_network_policies             = "Disabled"
      [32m+[0m[0m private_link_service_network_policies_enabled = true
      [32m+[0m[0m resource_group_name                           = "lw-weaponofchoice-rg"
      [32m+[0m[0m virtual_network_name                          = "ansible-app-server-vnet"
    }

[1m  # azurerm_subnet.subnet[0m will be created
[0m  [32m+[0m[0m resource "azurerm_subnet" "subnet" {
      [32m+[0m[0m address_prefixes                              = [
          [32m+[0m[0m "10.0.1.0/24",
        ]
      [32m+[0m[0m default_outbound_access_enabled               = true
      [32m+[0m[0m id                                            = (known after apply)
      [32m+[0m[0m name                                          = "ansible-app-server-subnet"
      [32m+[0m[0m private_endpoint_network_policies             = "Disabled"
      [32m+[0m[0m private_link_service_network_policies_enabled = true
      [32m+[0m[0m resource_group_name                           = "lw-weaponofchoice-rg"
      [32m+[0m[0m virtual_network_name                          = "ansible-app-server-vnet"
    }

[1m  # azurerm_virtual_network.vnet[0m will be created
[0m  [32m+[0m[0m resource "azurerm_virtual_network" "vnet" {
      [32m+[0m[0m address_space                  = [
          [32m+[0m[0m "10.0.0.0/16",
        ]
      [32m+[0m[0m dns_servers                    = (known after apply)
      [32m+[0m[0m guid                           = (known after apply)
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m location                       = "uksouth"
      [32m+[0m[0m name                           = "ansible-app-server-vnet"
      [32m+[0m[0m private_endpoint_vnet_policies = "Disabled"
      [32m+[0m[0m resource_group_name            = "lw-weaponofchoice-rg"
      [32m+[0m[0m subnet                         = (known after apply)
    }

[1mPlan:[0m 9 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m bastion_host_ip   = (known after apply)
  [32m+[0m[0m bastion_host_name = "example-bastion"
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @Louis-Solirius, Action: `pull_request`*